Tekla Open API Reference for Tekla Structures 2025
AnalysisDesignParameter Constructor (String, Int32, Identifier, Double)
 Initializes a new instance of the AnalysisDesignParameter class.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisDesignParameter(
	string analysisModelName,
	int parameterId,
	Identifier partId,
	double value
)
Public Sub New (
	analysisModelName As String,
	parameterId As Integer,
	partId As Identifier,
	value As Double
)
Parameters
analysisModelName
Type: System.String
 The analysis model name.
parameterId
Type: System.Int32
 The analysis design parameter ID.
partId
Type: Tekla.Structures.Identifier
 The father part ID.
value
Type: System.Double
 The value.
See Also
Reference
AnalysisDesignParameter Class
AnalysisDesignParameter Overload
Tekla.Structures.Analysis Namespace